---
type: SlabShapeVertex
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# SlabShapeVertex

`Autodesk.Revit.DB.SlabShapeVertex` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Position | — | `public XYZ Position { get ; }` |
| Property | VertexType | — | `public SlabShapeVertexType VertexType { get ; }` |